areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c-sagittariuss-08.h
#endif // declarations of pin RD7

// Function declarations of port pin RD8
#if defined (_TRISD8)
static const P33C_GPIO_t PIN_RD8 = {
    .Properties.Port         = 3,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 8,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = -1,                      ///< (not available)
    .Properties.ADCAN        = -1,                      ///< (not available)
    .Properties.ADCORE       = -1,                      ///< (not available)
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = 1,                       ///< Index of SPI peripheral instance available at this device pin, =-1 if not available
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #ifdef SPI1CON1L
    .Objects.SPI             = (P33C_SPI_INSTANCE_t*)&SPI1CON1L, ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #else
    .Objects.SPI             = NULL,                    ///< (not available)
    #endif
    .Methods.Get            = &__builtin_RD8_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RD8_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RD8_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RD8_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RD8_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RD8_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RD8_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RD8_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RD8_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RD8_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RD8_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RD8_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RD8_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RD8_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RD8_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RD8_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RD8_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RD8

// Function declarations of port pin RD9
#if defined (_TRISD9)
static const P33C_GPIO_t PIN_RD9 = {
    .Properties.Port         = 3,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 9,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = -1,                      ///< (not available)
    .Properties.ADCAN        = -1,                      ///< (not available)
    .Properties.ADCORE       = -1,                      ///< (not available)
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RD9_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RD9_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RD9_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RD9_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RD9_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RD9_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RD9_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RD9_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RD9_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RD9_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RD9_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RD9_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RD9_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RD9_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RD9_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RD9_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RD9_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RD9

